[
  {
    "title": "Web Framework",
    "values": [
      {
        "key": "react",
        "name": "React",
        "logo": "/assets/imgs/react.png",
        "description": [
          "### Just The UI",
          "Lots of people use React as the V in MVC. Since React makes no assumptions about the rest of your technology stack, it's easy to try it out on a small feature in an existing project.",
          "### Virtual DOM",
          "React abstracts away the DOM, giving a simpler programming model and better performance. React can also render on the server using Node, and it can power native apps using React Native.",
          "### Data Flow",
          "React implements one-way reactive data flow which reduces boilerplate and is easier to reason about than traditional data binding."
        ]
      },
      {
        "key": "angular1",
        "name": "Angular 1",
        "logo": "/assets/imgs/angular1.png",
        "description": [
          "### Why AngularJS?",
          "HTML is great for declaring static documents, but it falters when we try to use it for declaring dynamic views in web-applications. AngularJS lets you extend HTML vocabulary for your application. The resulting environment is extraordinarily expressive, readable, and quick to develop.",
          "### Alternatives",
          "Other frameworks deal with HTML’s shortcomings by either abstracting away HTML, CSS, and/or JavaScript or by providing an imperative way for manipulating the DOM. Neither of these address the root problem that HTML was not designed for dynamic views.",
          "### Extensibility",
          "AngularJS is a toolset for building the framework most suited to your application development. It is fully extensible and works well with other libraries. Every feature can be modified or replaced to suit your unique development workflow and feature needs. Read on to find out how."
        ]
      },
      {
        "key": "angular2",
        "name": "Angular 2",
        "logo": "/assets/imgs/angular2.png",
        "description": [
          "### Develop Across All Platforms",
          "Learn one way to build applications with Angular and reuse your code and abilities to build apps for any deployment target. For web, mobile web, native mobile and native desktop.",
          "### Speed & Performance",
          "Achieve the maximum speed possible on the Web Platform today, and take it further, via Web Workers and server-side rendering.",
          "",
          "Angular puts you in control over scalability. Meet huge data requirements by building data models on RxJS, Immutable.js or another push-model.",
          "### Incredible Tooling",
          "Build features quickly with simple, declarative templates. Extend the template language with your own components and use a wide array of existing components. Get immediate Angular-specific help and feedback with nearly every IDE and editor. All this comes together so you can focus on building amazing apps rather than trying to make the code work."
        ]
      }
    ]
  },
  {
    "title": "Module management",
    "values": [
      {
        "key": "webpack",
        "name": "Webpack and NPM",
        "logo": "/assets/imgs/webpack.png",
        "description": [
          "### Why another module bundler?",
          "Existing module bundlers are not well suited for big projects (big single page applications). The most pressing reason for developing another module bundler was Code Splitting and that static assets should fit seamlessly together through modularization.",
          "",
          "I tried to extend existing module bundlers, but it wasn’t possible to achieve all goals.",
          "### Goals",
          "- Split the dependency tree into chunks loaded on demand",
          "- Keep initial loading time low",
          "- Every static asset should be able to be a module",
          "- Ability to integrate 3rd-party libraries as modules",
          "- Ability to customize nearly every part of the module bundler",
          "- Suited for big projects"
        ]
      },
      {
        "key": "systemjs",
        "name": "SystemJS and JSPM",
        "logo": "/assets/imgs/systemjs.png",
        "description": [
          "Universal dynamic module loader - loads ES6 modules, AMD, CommonJS and global scripts in the browser and NodeJS. Works with both Traceur and Babel.",
          "",
          "- Loads any module format with exact circular reference and binding support.",
          "- Loads ES6 modules compiled into the System.register bundle format for production, maintaining circular references support.",
          "- Supports RequireJS-style map, paths, bundles and global shims.",
          "- Loader plugins allow loading assets through the module naming system such as CSS, JSON or images."
        ]
      },
      {
        "key": "inject",
        "name": "No modules and Bower",
        "logo": "/assets/imgs/bower.png",
        "description": [
          "Web sites are made of lots of things — frameworks, libraries, assets, and utilities. Bower manages all these things for you.",
          "",
          "Keeping track of all these packages and making sure they are up to date (or set to the specific versions you need) is tricky. Bower to the rescue!",
          "",
          "Bower can manage components that contain HTML, CSS, JavaScript, fonts or even image files. Bower doesn’t concatenate or minify code or do anything else - it just installs the right versions of the packages you need and their dependencies."
        ]
      }
    ]
  },
  {
    "title": "JavaScript preprocessing",
    "values": [
      {
        "key": "js",
        "name": "JavaScript (no preprocessors)",
        "logo": "/assets/imgs/js.png",
        "description": [
          "Good old JavaScript with all the features and quirks we love and hate.",
          "",
          "No preprocessing on the JavaScript code. You'll get (almost) your code on the browser.",
          "",
          "It allows you to use the exact level of syntax depending on your browsers requirements."
        ]
      },
      {
        "key": "babel",
        "name": "ECMAScript 2015 with Babel",
        "logo": "/assets/imgs/babel.png",
        "description": [
          "### ES2015 and beyond",
          "Babel has support for the latest version of JavaScript through syntax transformers. These plugins allow you to use new syntax, right now without waiting for browser support. Check out our ES2015 preset to get started.",
          "### Polyfill",
          "Since Babel only transforms syntax (like arrow functions), you can use babel-polyfill in order to support new globals such as Promise or new native methods like String.padStart (left-pad). It uses core-js and regenerator. Check out our babel-polyfill docs for more info.",
          "### JSX and Flow",
          "Babel can convert JSX syntax and strip out type annotations. Check out our React preset to get started. Use it together with the babel-sublime package to bring syntax highlighting to a whole new level.",
          "### Pluggable",
          "Babel is built out of plugins. Compose your own transformation pipeline using existing plugins or write your own. Easily use a set of plugins by using or creating a preset."
        ]
      },
      {
        "key": "typescript",
        "name": "TypeScript",
        "logo": "/assets/imgs/typescript.png",
        "description": [
          "### Starts and ends with JavaScript",
          "TypeScript starts from the same syntax and semantics that millions of JavaScript developers know today. Use existing JavaScript code, incorporate popular JavaScript libraries, and call TypeScript code from JavaScript.",
          "TypeScript compiles to clean, simple JavaScript code which runs on any browser, in Node.js, or in any JavaScript engine that supports ECMAScript 3 (or newer).",
          "### Strong tools for large apps",
          "Types enable JavaScript developers to use highly-productive development tools and practices like static checking and code refactoring when developing JavaScript applications.",
          "Types are optional, and type inference allows a few type annotations to make a big difference to the static verification of your code. Types let you define interfaces between software components and gain insights into the behavior of existing JavaScript libraries.",
          "### State of the art JavaScript",
          "TypeScript offers support for the latest and evolving JavaScript features, including those from ECMAScript 2015 and future proposals, like async functions and decorators, to help build robust components.",
          "These features are available at development time for high-confidence app development, but are compiled into simple JavaScript that targets ECMAScript 3 (or newer) environments."
        ]
      }
    ]
  },
  {
    "title": "CSS preprocessing",
    "values": [
      {
        "key": "css",
        "name": "CSS (no preprocessors)",
        "logo": "/assets/imgs/css.png",
        "description": [
          "Good old CSS with all the features and quirks we love and hate.",
          "",
          "No preprocessing on the CSS code. You'll get (almost) your code on the browser.",
          "",
          "It allows you to use the exact level of syntax depending on your browsers requirements."
        ]
      },
      {
        "key": "scss",
        "name": "Sass",
        "logo": "/assets/imgs/sass.png",
        "description": [
          "### CSS Compatible",
          "Sass is completely compatible with all versions of CSS. We take this compatibility seriously, so that you can seamlessly use any available CSS libraries.",
          "### Feature Rich",
          "Sass boasts more features and abilities than any other CSS extension language out there. The Sass Core Team has worked endlessly to not only keep up, but stay ahead.",
          "### Mature",
          "Sass has been actively supported for over 9 years by its loving Core Team.",
          "### Industry Approved",
          "Over and over again, the industry is choosing Sass as the premier CSS extension language.",
          "### Large Community",
          "Sass is actively supported and developed by a consortium of several tech companies and hundreds of developers.",
          "### Framework",
          "There are endless number of frameworks built with Sass. Compass, Bourbon, and Susy just to name a few."
        ]
      },
      {
        "key": "less",
        "name": "Less",
        "logo": "/assets/imgs/less.png",
        "description": [
          "Less is a CSS pre-processor, meaning that it extends the CSS language, adding features that allow variables, mixins, functions and many other techniques that allow you to make CSS that is more maintainable, themable and extendable.",
          "",
          "Less runs inside Node, in the browser and inside Rhino. There are also many 3rd party tools that allow you to compile your files and watch for changes. The quickest place for first experiments with less is our online editor."
        ]
      },
      {
        "key": "styl",
        "name": "Stylus",
        "logo": "/assets/imgs/stylus.png",
        "description": [
          "Robust, expressive, and feature-rich CSS superset",
          "",
          "Stylus is a revolutionary new language, providing an efficient, dynamic, and expressive way to generate CSS. Supporting both an indented syntax and regular CSS style."
        ]
      }
    ]
  },
  {
    "title": "Template",
    "values": [
      {
        "key": "hello",
        "name": "Hello World",
        "logo": "/assets/imgs/helloworld.png",
        "description": [
          "The simplest Hello World app for you to build exactly what you want."
        ]
      },
      {
        "key": "techs",
        "name": "Fountain landing page",
        "logo": "/assets/imgs/fountain.png",
        "description": [
          "The standard Fountain landing page listing the technologies you choose. Illustrate a little app with the framework you choose."
        ]
      },
      {
        "key": "todoMVC",
        "name": "TodoMVC",
        "logo": "/assets/imgs/todomvc.png",
        "description": [
          "A working implementation of the one and only TodoMVC"
        ]
      }
    ]
  }
]
